@ECHO OFF

@REM ウィンドウタイトル設定
TITLE ARK: Survival Ascended Restart

@REM 変数展開
SETLOCAL enabledelayedexpansion
for /f "tokens=1,* delims==" %%a in (setting.ini) do (
    SET %%a=%%b
)

@REM スクリプト実行パスの取得
SET SCRIPT_PATH=%~dp0

@REM ====1====+====2====+====3====+====4====+====5====+====6====+====7====+====8====+====9====+====0
@REM シャットダウン処理
@REM ====1====+====2====+====3====+====4====+====5====+====6====+====7====+====8====+====9====+====0
@CALL %SCRIPT_PATH%\shutdown.cmd

@REM ====1====+====2====+====3====+====4====+====5====+====6====+====7====+====8====+====9====+====0
@REM 起動処理
@REM ====1====+====2====+====3====+====4====+====5====+====6====+====7====+====8====+====9====+====0
@CALL %SCRIPT_PATH%\start.cmd
